# git init: Создает новый репозиторий Git.
# git add <file>: Добавляет файл в индекс для отслеживания изменений.
# git commit -m "message": Создает коммит с сообщением о изменениях.
# git remote add <name> <url>: Добавляет удаленный репозиторий с указанным именем и URL.
# git push: Отправляет коммиты в удаленный репозиторий.
# git checkout <branch>: Переключается на указанную ветку.

# git status: Показывает состояние репозитория.
# git diff: Показывает различия между рабочим деревом и индексом или последним коммитом.
# git clone <url>: Клонирует репозиторий на локальную машину.
# git pull: Получает и объединяет изменения из удаленного репозитория.
# git branch: Показывает список веток в репозитории, или создает ветку.

# git log: Отображает историю коммитов.
# git merge <branch>: Сливает указанную ветку с текущей веткой.
# git remote -v: Показывает список удаленных репозиториев.
# git reset <file>: Удаляет файл из индекса (но сохраняет его содержимое).
# git rm <file>: Удаляет файл из рабочего дерева и индекса.
# git stash: Сохраняет текущие изменения во временном хранилище.
# git tag <tagname>: Создает новый тег для указанного коммита.